In [3]:
import pandas as pd
# asteoroids = pd.read_csv('datasets/Asteroid Selection.csv')
# asteoroids.drop(columns=['Spec.type','Launch date (one-way)','Min total dv (km/s)'],inplace=True)
# asteoroids.rename(columns={'Launch date (round-trip)': 'Launch date'}, inplace=True)
# asteoroids.to_csv('datasets/Asteroid.csv', index=False)
# asteoroids
asteoroids = pd.read_csv('datasets/df.csv')
asteoroids.drop(columns=['Unnamed: 0','H','albedo','diameter','i','a','q','e','neo','spkid'],inplace=True)
asteoroids.rename(columns={'Launch date (round-trip)': 'Launch date'}, inplace=True)
asteoroids.to_csv('datasets/Asteroid.csv', index=False)
asteoroids

,spec_T,Surname,Name,OCC,Diameter,TOF,Launch_date,Min_dv,Duration,Stay
0,Other,1898 DQ,Eros,0,16.840,270.0,2025-08-13 00:00:00,14.41,348,8
1,0.8902148008346558,1911 MT,Albert,0,4.390,180.0,2048-04-22 00:00:00,23.15,448,8
2,Other,1918 DB,Alinda,0,4.200,420.0,2025-01-01 00:00:00,20.59,388,8
3,Other,1924 TD,Ganymed,0,37.675,160.0,2037-05-18 00:00:00,31.36,348,8
4,Other,1950 KA,Betulia,0,5.800,440.0,2027-12-09 00:00:00,40.73,350,10
...,...,...,...,...,...,...,...,...,...,...
321,0.8973981738090515,2002 DO3,NaN,6,0.230,310.0,2039-07-17 00:00:00,11.46,338,8
322,0.957049548625946,2002 DQ3,NaN,6,0.100,380.0,2032-06-13 00:00:00,10.93,443,8
323,0.9447842240333557,2002 EA,NaN,8,0.180,120.0,2030-09-02 00:00:00,15.00,353,8
324,0.9831030368804932,2002 EC,NaN,7,0.120,430.0,2042-09-29 00:00:00,13.27,173,8
325,0.9630048274993896,2009 DD45,NaN,4,0.040,230.0,2037-08-06 00:00:00,11.67,393,18

In [4]:
import pandas as pd
asteoroids = pd.read_csv('datasets/Asteroid.csv')

In [5]:
asteoroids

,spec_T,Surname,Name,OCC,Diameter,TOF,Launch_date,Min_dv,Duration,Stay
0,Other,1898 DQ,Eros,0,16.840,270.0,2025-08-13 00:00:00,14.41,348,8
1,0.8902148008346558,1911 MT,Albert,0,4.390,180.0,2048-04-22 00:00:00,23.15,448,8
2,Other,1918 DB,Alinda,0,4.200,420.0,2025-01-01 00:00:00,20.59,388,8
3,Other,1924 TD,Ganymed,0,37.675,160.0,2037-05-18 00:00:00,31.36,348,8
4,Other,1950 KA,Betulia,0,5.800,440.0,2027-12-09 00:00:00,40.73,350,10
...,...,...,...,...,...,...,...,...,...,...
321,0.8973981738090515,2002 DO3,NaN,6,0.230,310.0,2039-07-17 00:00:00,11.46,338,8
322,0.957049548625946,2002 DQ3,NaN,6,0.100,380.0,2032-06-13 00:00:00,10.93,443,8
323,0.9447842240333557,2002 EA,NaN,8,0.180,120.0,2030-09-02 00:00:00,15.00,353,8
324,0.9831030368804932,2002 EC,NaN,7,0.120,430.0,2042-09-29 00:00:00,13.27,173,8
325,0.9630048274993896,2009 DD45,NaN,4,0.040,230.0,2037-08-06 00:00:00,11.67,393,18

In [13]:
# asteoroids.drop(columns=['Spkid','Surname'], inplace=True)

In [6]:
asteoroids.rename(columns={'Diameter (km)': 'Diameter', 'Min total dv (km/s).1': 'Min_dv', 'Launch date': 'Launch_date', 'Mission duration (days)': 'Duration', 'Stay (days)': 'Stay', 'TOF (days)': 'TOF'}, inplace=True)

In [8]:
import re

def replace_range_with_middle(text):
    match = re.search(r'(\d+(\,\d+)?) Ã· (\d+(\.\d+)?)', text)
    if match:
        num1 = float(match.group(1).replace(',','.'))
        num2 = float(match.group(3))
        middle = (num1 + num2) / 2
        return float(text.replace(match.group(0), str(round(middle, 2))))
    return float(text.replace(',','.'))

asteoroids['Diameter'] = asteoroids['Diameter'].apply(replace_range_with_middle)

In [9]:
asteoroids

,spec_T,Surname,Name,OCC,Diameter,TOF,Launch_date,Min_dv,Duration,Stay
0,Other,1898 DQ,Eros,0,16.840,270.0,2025-08-13 00:00:00,14.41,348,8
1,0.8902148008346558,1911 MT,Albert,0,4.390,180.0,2048-04-22 00:00:00,23.15,448,8
2,Other,1918 DB,Alinda,0,4.200,420.0,2025-01-01 00:00:00,20.59,388,8
3,Other,1924 TD,Ganymed,0,37.675,160.0,2037-05-18 00:00:00,31.36,348,8
4,Other,1950 KA,Betulia,0,5.800,440.0,2027-12-09 00:00:00,40.73,350,10
...,...,...,...,...,...,...,...,...,...,...
321,0.8973981738090515,2002 DO3,NaN,6,0.230,310.0,2039-07-17 00:00:00,11.46,338,8
322,0.957049548625946,2002 DQ3,NaN,6,0.100,380.0,2032-06-13 00:00:00,10.93,443,8
323,0.9447842240333557,2002 EA,NaN,8,0.180,120.0,2030-09-02 00:00:00,15.00,353,8
324,0.9831030368804932,2002 EC,NaN,7,0.120,430.0,2042-09-29 00:00:00,13.27,173,8
325,0.9630048274993896,2009 DD45,NaN,4,0.040,230.0,2037-08-06 00:00:00,11.67,393,18

In [11]:
asteoroids['Launch_date'] = pd.to_datetime(asteoroids['Launch_date'], format='%Y-%m-%d')

In [16]:
def process_column(value):
    try:
        # Try to convert to float and round to 3 decimal places
        return f"{round(float(value), 2):.2f}"
    except ValueError:
        # If conversion fails, return the original value
        return value

# Apply the function to the column
asteoroids['spec_T'] = asteoroids['spec_T'].apply(process_column)

In [17]:
asteoroids

,spec_T,Surname,Name,OCC,Diameter,TOF,Launch_date,Min_dv,Duration,Stay
0,Other,1898 DQ,Eros,0,16.840,270.0,2025-08-13 00:00:00,14.41,348,8
1,0.89,1911 MT,Albert,0,4.390,180.0,2048-04-22 00:00:00,23.15,448,8
2,Other,1918 DB,Alinda,0,4.200,420.0,2025-01-01 00:00:00,20.59,388,8
3,Other,1924 TD,Ganymed,0,37.675,160.0,2037-05-18 00:00:00,31.36,348,8
4,Other,1950 KA,Betulia,0,5.800,440.0,2027-12-09 00:00:00,40.73,350,10
...,...,...,...,...,...,...,...,...,...,...
321,0.90,2002 DO3,NaN,6,0.230,310.0,2039-07-17 00:00:00,11.46,338,8
322,0.96,2002 DQ3,NaN,6,0.100,380.0,2032-06-13 00:00:00,10.93,443,8
323,0.94,2002 EA,NaN,8,0.180,120.0,2030-09-02 00:00:00,15.00,353,8
324,0.98,2002 EC,NaN,7,0.120,430.0,2042-09-29 00:00:00,13.27,173,8
325,0.96,2009 DD45,NaN,4,0.040,230.0,2037-08-06 00:00:00,11.67,393,18

In [19]:
import sqlite3

conn = sqlite3.connect("database.db")
cursor = conn.cursor()

cursor.execute("DROP TABLE IF EXISTS ASTEROIDS;")
cursor.execute("""
CREATE TABLE ASTEROIDS (
    spec_T INTEGER NOT NULL,
    Surname TEXT NOT NULL,
    Name TEXT,
    OCC INTEGER NOT NULL,
    Diameter REAL NOT NULL,
    TOF REAL NOT NULL,
    Launch_date DATE NOT NULL,
    Min_dv REAL NOT NULL,
    Duration INTEGER NOT NULL,
    Stay INTEGER NOT NULL
)
""")
print("Table created successfully.")

asteoroids.to_sql("ASTEROIDS", conn, if_exists="append", index=False)
print("Data inserted successfully.")

conn.commit()
conn.close()

Table created successfully.
Data inserted successfully.

In [20]:
import pandas as pd
import sqlite3

conn = sqlite3.connect("database.db")
cursor = conn.cursor()
query = "SELECT * FROM ASTEROIDS;"
df = pd.read_sql_query(query, conn)
df

,spec_T,Surname,Name,OCC,Diameter,TOF,Launch_date,Min_dv,Duration,Stay
0,Other,1898 DQ,Eros,0,16.840,270.0,2025-08-13 00:00:00,14.41,348,8
1,0.89,1911 MT,Albert,0,4.390,180.0,2048-04-22 00:00:00,23.15,448,8
2,Other,1918 DB,Alinda,0,4.200,420.0,2025-01-01 00:00:00,20.59,388,8
3,Other,1924 TD,Ganymed,0,37.675,160.0,2037-05-18 00:00:00,31.36,348,8
4,Other,1950 KA,Betulia,0,5.800,440.0,2027-12-09 00:00:00,40.73,350,10
...,...,...,...,...,...,...,...,...,...,...
321,0.9,2002 DO3,None,6,0.230,310.0,2039-07-17 00:00:00,11.46,338,8
322,0.96,2002 DQ3,None,6,0.100,380.0,2032-06-13 00:00:00,10.93,443,8
323,0.94,2002 EA,None,8,0.180,120.0,2030-09-02 00:00:00,15.00,353,8
324,0.98,2002 EC,None,7,0.120,430.0,2042-09-29 00:00:00,13.27,173,8
325,0.96,2009 DD45,None,4,0.040,230.0,2037-08-06 00:00:00,11.67,393,18

spec_T TEXT NOT NULL -- Numeric/Text - Numeric values indicate probability of a most value asteroid type, "Other" indicates high probability for a different type.
Surname TEXT NOT NULL -- Catalogue Name of Asteroid.
Name TEXT -- Common Name of Asteroid (not everyone has it).
OCC INTEGER NOT NULL -- Orbit condition code, defines the asteroidâ€™s orbit accuracy where 0 implies a well-determined orbit and 9 implies a very poorly-determined (highly uncertain) orbit.
Diameter REAL NOT NULL -- Mean Diameter in kilometers.
TOF REAL NOT NULL -- Time Of Flight to asteroid estimated for mission.
Launch_date DATE NOT NULL -- Date of Launch for mission.
Min_dv REAL NOT NULL -- Minimal requirement delta of Velocity.
Duration INTEGER NOT NULL -- Expected Duration of a whole mission.
Stay INTEGER NOT NULL -- How many days can mission stay for mining at asteroid.

In [20]:
import random
asteoroids['Class'] = [random.choice(['M', 'S', 'C']) for _ in range(len(asteoroids))]
asteoroids

,Spkid,Surname,Name,OCC,Diameter,TOF,Launch_date,Min_dv,Duration,Stay,Class
0,2000433,1898 DQ,Eros,0,16.840,270,2025-08-13,14.41,348,8,C
1,2000719,1911 MT,Albert,0,4.390,180,2048-04-22,23.15,448,8,S
2,2000887,1918 DB,Alinda,0,4.200,420,2025-01-01,20.59,388,8,S
3,2001036,1924 TD,Ganymed,0,37.675,160,2037-05-18,31.36,348,8,M
4,2001580,1950 KA,Betulia,0,5.800,440,2027-12-09,40.73,350,10,S
...,...,...,...,...,...,...,...,...,...,...,...
321,3114075,2002 DO3,NaN,6,0.230,310,2039-07-17,11.46,338,8,C
322,3114077,2002 DQ3,NaN,6,0.100,380,2032-06-13,10.93,443,8,S
323,3114105,2002 EA,NaN,8,0.180,120,2030-09-02,15.00,353,8,M
324,3114106,2002 EC,NaN,7,0.120,430,2042-09-29,13.27,173,8,C
325,3448992,2009 DD45,NaN,4,0.040,230,2037-08-06,11.67,393,18,S

In [21]:
import sqlite3

conn = sqlite3.connect("database2.db")
cursor = conn.cursor()

cursor.execute("DROP TABLE IF EXISTS ASTEROIDS;")
cursor.execute("""
CREATE TABLE ASTEROIDS (
    Spkid INTEGER NOT NULL,
    Surname TEXT NOT NULL,
    Name TEXT,
    OCC INTEGER NOT NULL,
    Diameter REAL NOT NULL,
    TOF REAL NOT NULL,
    Launch_date DATE NOT NULL,
    Min_dv REAL NOT NULL,
    Duration INTEGER NOT NULL,
    Stay INTEGER NOT NULL,
    Class TEXT NOT NULL
)
""")
print("Table created successfully.")

asteoroids.to_sql("ASTEROIDS", conn, if_exists="append", index=False)
print("Data inserted successfully.")

conn.commit()
conn.close()

Table created successfully.
Data inserted successfully.

In [23]:
import pandas as pd
import sqlite3

conn = sqlite3.connect("database2.db")
cursor = conn.cursor()
query = "SELECT * FROM ASTEROIDS;"
df = pd.read_sql_query(query, conn)
df

,Spkid,Surname,Name,OCC,Diameter,TOF,Launch_date,Min_dv,Duration,Stay,Class
0,2000433,1898 DQ,Eros,0,16.840,270.0,2025-08-13 00:00:00,14.41,348,8,C
1,2000719,1911 MT,Albert,0,4.390,180.0,2048-04-22 00:00:00,23.15,448,8,S
2,2000887,1918 DB,Alinda,0,4.200,420.0,2025-01-01 00:00:00,20.59,388,8,S
3,2001036,1924 TD,Ganymed,0,37.675,160.0,2037-05-18 00:00:00,31.36,348,8,M
4,2001580,1950 KA,Betulia,0,5.800,440.0,2027-12-09 00:00:00,40.73,350,10,S
...,...,...,...,...,...,...,...,...,...,...,...
321,3114075,2002 DO3,None,6,0.230,310.0,2039-07-17 00:00:00,11.46,338,8,C
322,3114077,2002 DQ3,None,6,0.100,380.0,2032-06-13 00:00:00,10.93,443,8,S
323,3114105,2002 EA,None,8,0.180,120.0,2030-09-02 00:00:00,15.00,353,8,M
324,3114106,2002 EC,None,7,0.120,430.0,2042-09-29 00:00:00,13.27,173,8,C
325,3448992,2009 DD45,None,4,0.040,230.0,2037-08-06 00:00:00,11.67,393,18,S